
Функция HealthCheckGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтруктураОтвета = Новый Структура("status, timestamp","Ok",ТекущаяДатаСеанса());
	Возврат ПК_ПрограммныйИнтерфейсHTTP.ОтветJSON(СтруктураОтвета, Ответ);
КонецФункции


Функция PaymentOrdersPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	ПараметрыЗапроса = ПК_ПрограммныйИнтерфейсHTTP.ИсполнитьЗапрос(Запрос);
	Возврат Ответ;
КонецФункции

Функция PaymentOrderGET(Запрос)
	Ответ = ПК_ПрограммныйИнтерфейсHTTP.ИсполнитьЗапрос(Запрос, "ПлатежныеПоручения");
	Возврат СформироватьОтвет(Ответ);
КонецФункции


Функция ContractsGET(Запрос)
	Ответ = ПК_ПрограммныйИнтерфейсHTTP.ИсполнитьЗапрос(Запрос, "ДоговорыКонтрагентов");
	Возврат СформироватьОтвет(Ответ);
КонецФункции

Функция PaymentOrderPATCH(Запрос)
	Ответ = ПК_ПрограммныйИнтерфейсHTTP.ИсполнитьЗапрос(Запрос, "ПлатежныеПоручения");
	Возврат СформироватьОтвет(Ответ);
КонецФункции

Функция СформироватьОтвет(Знач СтруктураОтвета)
	HTTPОтвет = Новый HTTPСервисОтвет(СтруктураОтвета.КодОтвета);
	HTTPОтвет.УстановитьТелоИзСтроки(СтруктураОтвета.СтрокаОтвета);
	HTTPОтвет.Заголовки.Вставить("Content-Type", "application/json");
	Возврат HTTPОтвет;
КонецФункции




