Процедура ЗарегистрироватьОшибку(Ошибка, ОшибкиВРамкахТранзакции = Неопределено, ИмяСобытия = "Ошибка") Экспорт
	ОписаниеОшибки = ПолучитьОписаниеОшибки(Ошибка);
	Если Не ОшибкиВРамкахТранзакции = Неопределено Тогда
		ОшибкиВРамкахТранзакции.Добавить(ОписаниеОшибки);
	КонецЕсли;
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки,
	РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
КонецПроцедуры

Функция ПолучитьОписаниеОшибки(Ошибка) Экспорт
	
	ОписаниеОшибки = "";
	
	Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
		
		ОписаниеОшибки = Ошибка;
		
	Иначе
		
		Если Ошибка.Причина <> Неопределено Тогда
			ОписаниеОшибки = Ошибка.Описание + Символы.ПС + Ошибка.Причина.Описание;
		Иначе
			ОписаниеОшибки = Ошибка.Описание;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОписаниеОшибки;
	
КонецФункции

Функция СформироватьСтруктуруОтвета(ПараметрыЗапросаHTTP) Экспорт

	Префикс = "ПК_";
	
	Модуль = ОбщегоНазначения.ОбщийМодуль(Префикс + ПараметрыЗапросаHTTP.НаименованиеМодуля);

	Возврат Модуль.ДанныеДляОтвета(ПараметрыЗапросаHTTP);

КонецФункции // ПолучитьРезультатВыполнения()
