Функция ДанныеДляОтвета(ПараметрыЗапросаHTTP) Экспорт
	
	Перем Ответ;
	
	Запрос = Новый Запрос;
	//TODO: Удалить тестовые комменты
	//Установка значений параметров
	//Запрос.УстановитьПараметр("ContractUUID", Новый УникальныйИдентификатор("abf6460b-b57b-11ec-80f0-ac1f6b470613"));

	Запрос.Текст = "ВЫБРАТЬ
	|	Представление(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДоговорыКонтрагентов.Ссылка)) КАК ContractUUID,
	|	ДоговорыКонтрагентов.Наименование КАК ContractName,
	|	ДоговорыКонтрагентов.Дата КАК ContractDate,
	|	Представление(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДоговорыКонтрагентов.Владелец)) КАК ClientUUID,
	|	Контрагенты.Наименование КАК ClientName
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО (ДоговорыКонтрагентов.Владелец = Контрагенты.Ссылка)
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И НЕ ДоговорыКонтрагентов.ДоговорЗакрыт";

	Если ПК_ОбщегоНазначенияСервер.ЕстьПараметрыURL(ПараметрыЗапросаHTTP.ПараметрыURL) Тогда

		Запрос.Текст = Запрос.Текст + " И УникальныйИдентификатор(Контрагенты.Ссылка) = &ClientUUID";
		Запрос.УстановитьПараметр("ClientUUID", Новый УникальныйИдентификатор(ПараметрыЗапросаHTTP.ПараметрыURL.Получить("ClientUUID")));

	КонецЕсли;

	Результат = Запрос.Выполнить();
	
	Возврат ПК_ОбщегоНазначенияСервер.РезультатЗапросаВСтруктуруИлиМассив(Результат);

КонецФункции // АктивныеДоговорыКонтрагента()



 
