Функция ЕстьПараметрыURL(ПараметрыURL) Экспорт
	Возврат ПараметрыURL.Количество() > 0;
КонецФункции // ()


Функция РезультатЗапросаВСтруктуруИлиМассив(РезультатЗапроса) Экспорт
	
	Перем Ответ;
	Если РезультатЗапроса.Пустой() Тогда
		
		Ответ = Неопределено;
		
	Иначе
		
		РезультатТаблица = РезультатЗапроса.Выгрузить();
		
		Если РезультатТаблица.Количество() > 1 Тогда
			МассивЗначений = Новый Массив;
			Для каждого Строка Из РезультатТаблица Цикл
				МассивЗначений.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Строка));
			КонецЦикла;
			Ответ = МассивЗначений;
		Иначе
			Ответ = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатТаблица[0]);

		КонецЕсли;

	КонецЕсли;
	
	Возврат Ответ;
КонецФункции // РезультатЗапросаВСтруктуруИлиМассив()

Функция ЭтоGET(Метод) Экспорт

	Возврат Метод = "GET";

КонецФункции // ЭтоGET()

Функция ЭтоPOST(Метод) Экспорт

	Возврат Метод = "POST";

КонецФункции // ЭтоPOST()

Функция ЭтоPATCH(Метод) Экспорт

	Возврат Метод = "PATCH";

КонецФункции // ЭтоPATCH()


Процедура УстановитьРеквизитНеПустымЗначением(Объект, ИмяРеквизита, Значение) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		Объект[ИмяРеквизита] = Значение;
	КонецЕсли;
	
КонецПроцедуры




